; domain
(define (domain miconic)
  (:requirements :typing :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem miconic-prob-9f-9p)
  (:domain miconic)

  (:objects
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 - floor
  )

  (:init
    (origin p1 f9)
    (destin p1 f1)
    (not-boarded p1)
    (not-served p1)
    (origin p2 f7)
    (destin p2 f9)
    (not-boarded p2)
    (not-served p2)
    (origin p3 f7)
    (destin p3 f1)
    (not-boarded p3)
    (not-served p3)
    (origin p4 f3)
    (destin p4 f2)
    (not-boarded p4)
    (not-served p4)
    (origin p5 f7)
    (destin p5 f2)
    (not-boarded p5)
    (not-served p5)
    (origin p6 f3)
    (destin p6 f1)
    (not-boarded p6)
    (not-served p6)
    (origin p7 f5)
    (destin p7 f4)
    (not-boarded p7)
    (not-served p7)
    (origin p8 f9)
    (destin p8 f1)
    (not-boarded p8)
    (not-served p8)
    (origin p9 f6)
    (destin p9 f4)
    (not-boarded p9)
    (not-served p9)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f7 f8)
    (above f7 f9)
    (above f8 f9)
    (lift-at f6)
  )

  (:goal (and
    (served p1)
    (served p2)
    (served p3)
    (served p4)
    (served p5)
    (served p6)
    (served p7)
    (served p8)
    (served p9)
  ))
)

; plan
1. (board f6 p9)
   added: (boarded p9)
   goals met: 0 of 9
2. (up f6 f7)
   deleted: (lift-at f6)
   added: (lift-at f7)
   goals met: 0 of 9
3. (board f7 p3)
   added: (boarded p3)
   goals met: 0 of 9
4. (board f7 p5)
   added: (boarded p5)
   goals met: 0 of 9
5. (board f7 p2)
   added: (boarded p2)
   goals met: 0 of 9
6. (up f7 f9)
   deleted: (lift-at f7)
   added: (lift-at f9)
   goals met: 0 of 9
7. (board f9 p1)
   added: (boarded p1)
   goals met: 0 of 9
8. (board f9 p8)
   added: (boarded p8)
   goals met: 0 of 9
9. (depart f9 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 1 of 9
10. (down f9 f5)
   deleted: (lift-at f9)
   added: (lift-at f5)
   goals met: 1 of 9
11. (board f5 p7)
   added: (boarded p7)
   goals met: 1 of 9
12. (down f5 f4)
   deleted: (lift-at f5)
   added: (lift-at f4)
   goals met: 1 of 9
13. (depart f4 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 2 of 9
14. (depart f4 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 3 of 9
15. (down f4 f3)
   deleted: (lift-at f4)
   added: (lift-at f3)
   goals met: 3 of 9
16. (board f3 p6)
   added: (boarded p6)
   goals met: 3 of 9
17. (board f3 p4)
   added: (boarded p4)
   goals met: 3 of 9
18. (down f3 f2)
   deleted: (lift-at f3)
   added: (lift-at f2)
   goals met: 3 of 9
19. (depart f2 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 4 of 9
20. (depart f2 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 5 of 9
21. (down f2 f1)
   deleted: (lift-at f2)
   added: (lift-at f1)
   goals met: 5 of 9
22. (depart f1 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 6 of 9
23. (depart f1 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 7 of 9
24. (depart f1 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 8 of 9
25. (depart f1 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 9 of 9
